### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [260]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [79]:
# Show data into a Pandas Dataframe
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [261]:
# Look for missing values/ if any
purchase_data.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

## Player Count

* Display the total number of players

In [262]:
# Look for Unique players by SN by grouping and Unique SNs
# First extract the columns SN
player_count_df = purchase_data[["SN"]]
#Check to confirm data frame contains the data we're looking for 
player_count_df.head()

              SN
0        Lisim78
1    Lisovynya38
2     Ithergue48
3  Chamassasya86
4      Iskosia90

In [263]:
# Now to count unique SN's by grouping SN column
total_player_count_df = player_count_df['SN'].nunique()

In [264]:
# Print total player count
total_player_count_df

576

In [265]:
# Place above into a dictionary for the purposes of displaying nicely in a frame
total_player_count_dict = {'Total Player Count': [total_player_count_df]}
# Total Player Count as per below value:
total_player_count_dict

{'Total Player Count': [576]}

In [266]:
# Create a new neat summary dataframe
total_players_data = [['Total Players', total_player_count_df]]
total_players_data

[['Total Players', 576]]

In [97]:
# Label the headings for summary dataframe
total_players_summary_df = pd.DataFrame(data, columns = ['Summary Type', 'Total'])
# Print the summary dataframe
total_players_summary_df.head()

    Summary Type  Total
0  Total Players    576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [83]:
#1. Unique Items using same formula for SN as above to count distinct(unique) values in a column
unique_items_distinct_count = purchase_data['Item Name'].nunique()
#Print the unique items distinct count to check
unique_items_distinct_count

179

In [87]:
#2. Find the average/mean of the price column
average_item_price = purchase_data['Price'].mean()
#Print average price to check
average_item_price

3.050987179487176

In [90]:
#3. Find the total instances of purchases
total_instance_purchases = purchase_data['Item Name'].count()
# Print to check above
total_instance_purchases

780

In [101]:
#4. Sum the total of price to get revenue
total_revenue = purchase_data['Price'].sum()
# print to check above
total_revenue

2379.77

In [103]:
#Finish this! Place findings above 1 2 3 4 into a nice dataframe table
nice_dataframe=pd.DataFrame({"Total Unique Items":[unique_items_distinct_count],
                           "Average Item Price":[average_item_price],
                           "Total Instances Purchases":[total_instance_purchases],
                           "Total Revenue":[total_revenue]})
nice_dataframe=nice_dataframe[["Total Unique Items","Average Item Price","Total Instances Purchases","Total Revenue"]]
#Round the table to show only up to 2 decimal places where neccesary
nice_dataframe=nice_dataframe.round(2)
#Display the nice dataframe for summary
nice_dataframe.head()

,Total Unique Items,Average Item Price,Total Instances Purchases,Total Revenue
0,179,3.05,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [137]:
#Gender demographics
#re-purpose the data set into a new one and bring out gender and SN.
gender_demographics = purchase_data.loc[:, ["Gender", "SN", "Age"]]
#print to check
gender_demographics.head()

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [141]:
#drop the duplicates in serial number because we know there's 780 rows but only 576. This is to ensure we're working with unique players
gender_demographics = gender_demographics.drop_duplicates()
#print to check
gender_demographics.count()

Gender    576
SN        576
Age       576
dtype: int64

In [143]:
#need to count the genders
gender_count=gender_demographics["Gender"].value_counts()
#Print to check
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [156]:
#now to work out percentages which gender count divivded by the distinct count of players (in this case 576)
percentage_genders=gender_count/total_player_count_df*100
#put into percentages
#print to check
percentage_genders

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [152]:
#now put the above demographic gender calculations into a neat table
genders_table=pd.DataFrame({"Percentage":percentage_genders,"Total":gender_count})
#decimal round to 2 to make it neat
genders_table=genders_table.round(2)
#print to check this is the answer
genders_table

                       Percentage  Total
Male                        84.03    484
Female                      14.06     81
Other / Non-Disclosed        1.91     11


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [164]:
#Work Out all below by gender
#1. Purchase Count
#2. Average Purchase Price
#3. Total Purchase value
#4. Avg Total Purchase per person by gender

In [165]:
#1. Purchase Count
purchase_count=purchase_data.groupby(["Gender"]).count()["Price"]
#Print to check
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [167]:
#2. Average Purchase Price
purchase_avg_price=purchase_data.groupby(["Gender"]).mean()["Price"]
#Print to check
purchase_avg_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [172]:
#3. Total Purchase value
total_purchase_value=purchase_data.groupby(["Gender"]).sum()["Price"]
#Print to check
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [179]:
#4. Avg Total Purchase per person by gender
avg_purchase_gender = total_purchase_value/gender_count
#Print to check
avg_purchase_gender

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [181]:
#All(1,2,3,4) into one table table
purchase_table = pd.DataFrame({"Purchase Count":purchase_count,
                               "Average Purchase Price":purchase_avg_price,
                               "Total Purchase value":total_purchase_value,
                               "Avg Total Purchase per Person":avg_purchase_gender})
#round the decinmal values to 2
purchase_table = purchase_table.round(2)

#print the table
purchase_table

,Purchase Count,Average Purchase Price,Total Purchase value,Avg Total Purchase per Person
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [182]:
#1. Establish bins for ages
#2. Categorize the existing players using the age bins. Hint: use pd.cut()
#3. Calculate the numbers and percentages by age group
#4. Create a summary data frame to hold the results
#5. Optional: round the percentage column to two decimal points
#6. Display Age Demographics Table

In [419]:
#1. Create the bins for (Establish bins for ages)
bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
# Name the bins
age_bins=["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
#get the unique list of players to prepare to place them into the bins
unique_list_players = gender_demographics.loc[:, ["Gender", "Age"]]
#print to check
unique_list_players

     Gender  Age
0      Male   20
1      Male   40
2      Male   24
3      Male   24
4      Male   23
..      ...  ...
773    Male   21
774    Male   11
775  Female   21
777    Male   20
778    Male    7

[576 rows x 2 columns]

In [420]:
#2. Categorize the existing players using the age bins. Hint: use pd.cut()
#add column for ages within the labels created for the bins
unique_list_players["Ages"] = pd.cut(unique_list_players["Age"], bins, labels=age_bins)
#print to check
unique_list_players.head(5)

  Gender  Age   Ages
0   Male   20  20-24
1   Male   40    40+
2   Male   24  20-24
3   Male   24  20-24
4   Male   23  20-24

In [447]:
#3. Calculate the numbers and percentages by age group
#get the total within each bin
age_totals = unique_list_players["Ages"].value_counts()
#print to check
age_totals

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Ages, dtype: int64

In [422]:
#now to calculate the percentage age_totals by dividing the actual player total
age_percentage = (age_totals/total_player_count_df*100).round(2)
#print to check
age_percentage

20-24    44.79
15-19    18.58
25-29    13.37
30-34     9.03
35-39     5.38
10-14     3.82
<10       2.95
40+       2.08
Name: Ages, dtype: float64

In [423]:
#4. Create a summary data frame to hold the results
age_table=pd.DataFrame({"Age Totals":age_totals,
                        "Age %":age_percentage})
#print to check this is the answer
age_table

       Age Totals  Age %
20-24         258  44.79
15-19         107  18.58
25-29          77  13.37
30-34          52   9.03
35-39          31   5.38
10-14          22   3.82
<10            17   2.95
40+            12   2.08

In [279]:
#6. Display Age Demographics Table
#table needs to be sorted by the index to get it to show in the correct order
age_table.sort_index()

       Age Totals  Age %
<10            24   4.17
10-14          15   2.60
15-19         176  30.56
20-24         189  32.81
25-29         102  17.71
30-34          27   4.69
35-39          31   5.38
40+            12   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [427]:
#Group the ages together
groupby_age = purchase_data.groupby("Age")

In [436]:
#count the number of purchases by grouped ages
age_purchase_count = groupby_age["Purchase ID"].count()

In [432]:
#Average price by the grouped ages
age_average_price = groupby_age["Price"].mean()

In [446]:
#Group the data by age
age_total_purchase = groupby_age["Price"].sum()

In [448]:
#Count total Age of players
total_count_age = purchase_data["SN"].nunique()

In [450]:
#Calculate the average price by grouped ages
age_group_average_price = age_total_purchase/total_count_age

In [451]:
age_purchase_table = pd.DataFrame({"Purchase Count": age_purchase_count,
                                  "Average Purchase Price":age_average_price,
                                  "Avg Total Purchase per Person":age_group_average_price}) 

age_purchase_table

     Purchase Count  Average Purchase Price  Avg Total Purchase per Person
Age
7                 9                3.654444                       0.057101
8                 8                3.246250                       0.045087
9                 6                3.045000                       0.031719
10                9                3.536667                       0.055260
11                7                2.684286                       0.032622
12                6                2.633333                       0.027431
13                4                2.362500                       0.016406
14                2                3.455000                       0.011997
15               35                3.018571                       0.183420
16               30                3.018667                       0.157222
17               22                2.930909                       0.111944
18               26                3.162308                       0.142743
19               23                3.042609                       0.121493
20               99                3.174949                       0.545694
21               62                2.915161                       0.313785
22               70                2.955000                       0.359115
23               67                3.013881                       0.350573
24               67                3.137612                       0.364965
25               59                3.083051                       0.315799
26               14                2.870714                       0.069774
27               10                2.723000                       0.047274
28                5                1.690000                       0.014670
29               13                2.710000                       0.061163
30               35                3.152000                       0.191528
31                7                3.435714                       0.041753
32                8                2.836250                       0.039392
33               14                2.486429                       0.060434
34                9                2.458889                       0.038420
35               14                3.716429                       0.090330
36                5                2.532000                       0.021979
37                7                3.644286                       0.044288
38                9                3.794444                       0.059288
39                6                3.886667                       0.040486
40                6                2.785000                       0.029010
41                2                3.270000                       0.011354
42                1                3.930000                       0.006823
43                1                4.000000                       0.006944
44                2                2.680000                       0.009306
45                1                1.700000                       0.002951

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [305]:
#Run calculation for purchases by user
purchase_by_sn_count = purchase_data.groupby(["SN"]).count()["Price"]
#Decimal rounding to 2
purchase_by_sn_count = purchase_by_sn_count.round(2)
#print to check
purchase_by_sn_count.head(10)

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Aelastirin39    2
Aelidru27       1
Aelin32         3
Aelly27         2
Aellynun67      1
Name: Price, dtype: int64

In [302]:
#Run average purchase price
purchase_by_sn_average = purchase_data.groupby(["SN"]).mean()["Price"]
#Decimal rounding to 2
purchase_by_sn_average = purchase_by_sn_average.round(2)
#print to check
purchase_by_sn_average.head(10)

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Aelastirin39    3.64
Aelidru27       1.09
Aelin32         2.99
Aelly27         3.39
Aellynun67      3.74
Name: Price, dtype: float64

In [304]:
#Run total purchase by SN user
purchase_by_sn_total = purchase_data.groupby(["SN"]).sum()["Price"]
##Decimal rounding to 2
purchase_by_sn_total = purchase_by_sn_total.round(2)
#print to check
purchase_by_sn_total.head(10)

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Aelastirin39    7.29
Aelidru27       1.09
Aelin32         8.98
Aelly27         6.79
Aellynun67      3.74
Name: Price, dtype: float64

In [310]:
#Display the everything together into a table
top_spender_table = pd.DataFrame({"Purchase Count":purchase_by_sn_count,
                                  "Average Purchase Price":purchase_by_sn_average, 
                                  "Total Purchase Value":purchase_by_sn_total})
top_spender_table.sort_values("Total Purchase Value",ascending=False)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10
...                     ...                     ...                   ...
Ililsasya43               1                    1.02                  1.02
Irilis75                  1                    1.02                  1.02
Aidai61                   1                    1.01                  1.01
Chanirra79                1                    1.01                  1.01
Alo38                     1                    1.00                  1.00

[576 rows x 3 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [363]:
#Retrieve the item ID
item_id = purchase_data.groupby(purchase_data['Item ID'])
#Print to check
purchase_data.groupby('Item ID').head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
764,764,Saedaiphos46,18,Male,113,Solitude's Reaver,4.07
765,765,Irith83,18,Male,130,Alpha,2.07
766,766,Aelastirin39,23,Male,58,"Freak's Bite, Favor of Holy Might",4.14
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [370]:
#Unique List of Item IDs
unique_item_id = item_id['Item ID'].unique()
#print to check
unique_item_id

Item ID
0        [0]
1        [1]
2        [2]
3        [3]
4        [4]
       ...
178    [178]
179    [179]
181    [181]
182    [182]
183    [183]
Name: Item ID, Length: 179, dtype: object

In [371]:
#Unique List of Item names
unique_item_name = item_id['Item Name'].unique()
#print to check
unique_item_name

Item ID
0                                          [Splinter]
1                                          [Crucifer]
2                                           [Verdict]
3                                      [Phantomlight]
4                                [Bloodlord's Fetish]
                            ...
178    [Oathbreaker, Last Hope of the Breaking Storm]
179                 [Wolf, Promise of the Moonwalker]
181                                   [Reaper's Toll]
182                                       [Toothpick]
183                             [Dragon's Greatsword]
Name: Item Name, Length: 179, dtype: object

In [373]:
#purchase count for items
purchase_count = item_id['Item ID'].count()
#print to check
purchase_count

Item ID
0       4
1       4
2       6
3       6
4       5
       ..
178    12
179     6
181     5
182     3
183     3
Name: Item ID, Length: 179, dtype: int64

In [375]:
#Unique prices for the unique items
item_price = item_id['Price'].unique()
#print to check
item_price

Item ID
0            [1.28]
1      [3.26, 1.99]
2            [2.48]
3            [2.49]
4             [1.7]
           ...
178          [4.23]
179          [4.48]
181          [1.66]
182          [4.03]
183          [1.09]
Name: Price, Length: 179, dtype: object

In [378]:
#purchase total
purchase_item_total = item_id['Price'].sum()
#print to check
purchase_item_total

Item ID
0       5.12
1      11.77
2      14.88
3      14.94
4       8.50
       ...
178    50.76
179    26.88
181     8.30
182    12.09
183     3.27
Name: Price, Length: 179, dtype: float64

In [386]:
#put item table to together
unique_item_summary = pd.DataFrame({'Item ID': unique_item_id,
                                   'Item Name':unique_item_name,
                                   'Purchase Count':purchase_count,
                                   'Item price':item_price,
                                   'Total Purchase Value':purchase_item_total})

In [387]:
#print the table
unique_item_summary

,Item ID,Item Name,Purchase Count,Item price,Total Purchase Value
Item ID,,,,,
0,[0],[Splinter],4,[1.28],5.12
1,[1],[Crucifer],4,"[3.26, 1.99]",11.77
2,[2],[Verdict],6,[2.48],14.88
3,[3],[Phantomlight],6,[2.49],14.94
4,[4],[Bloodlord's Fetish],5,[1.7],8.50
...,...,...,...,...,...
178,[178],"[Oathbreaker, Last Hope of the Breaking Storm]",12,[4.23],50.76
179,[179],"[Wolf, Promise of the Moonwalker]",6,[4.48],26.88
181,[181],[Reaper's Toll],5,[1.66],8.30
182,[182],[Toothpick],3,[4.03],12.09
183,[183],[Dragon's Greatsword],3,[1.09],3.27

In [404]:
#Rearrange data to show popular ones on top
unique_item_summary = unique_item_summary.sort_values('Purchase Count', ascending=False)

In [405]:
#List the columns to present
unique_item_summary_df = unique_item_summary[['Item Name','Purchase Count','Total Purchase Value']]

In [406]:
#print to check
unique_item_summary_df

,Item Name,Purchase Count,Total Purchase Value
Item ID,,,
92,[Final Critic],13,59.99
178,"[Oathbreaker, Last Hope of the Breaking Storm]",12,50.76
145,[Fiery Glass Crusader],9,41.22
132,[Persuasion],9,28.99
108,"[Extraction, Quickblade Of Trembling Hands]",9,31.77
...,...,...,...
126,[Exiled Mithril Longsword],1,2.00
27,"[Riddle, Tribute of Ended Dreams]",1,3.30
47,"[Alpha, Reach of Ending Hope]",1,3.58
42,[The Decapitator],1,1.75
91,[Celeste],1,4.17

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [414]:
#rearrange data
most_profitable_item_summary_df = unique_item_summary_df.sort_values('Total Purchase Value', ascending=False)

In [415]:
#display most profitable items
most_profitable_item_summary_df

,Item Name,Purchase Count,Total Purchase Value
Item ID,,,
92,[Final Critic],13,59.99
178,"[Oathbreaker, Last Hope of the Breaking Storm]",12,50.76
82,[Nirvana],9,44.10
145,[Fiery Glass Crusader],9,41.22
103,[Singed Scalpel],8,34.80
...,...,...,...
28,"[Flux, Destroyer of Due Diligence]",2,2.12
126,[Exiled Mithril Longsword],1,2.00
125,[Whistling Mithril Warblade],2,2.00
104,[Gladiator's Glaive],1,1.93
42,[The Decapitator],1,1.75